<!DOCTYPE html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>
<meta name="theme-color" content="#222">









<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />
















  
  
    
  
  <link href="https://cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.css" rel="stylesheet" type="text/css" />




  
  
  
  

  

  

  

  

  

  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.3" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon.png?v=5.1.3">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32.png?v=5.1.3">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16.png?v=5.1.3">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.3" color="#222">





  <meta name="keywords" content="JavaScript," />










<meta name="description" content="This is a note for writing down what I have learnt through my work.  And this note is for JavaScript.">
<meta name="keywords" content="JavaScript">
<meta property="og:type" content="article">
<meta property="og:title" content="踩坑 - JavaScript 篇">
<meta property="og:url" content="http://yoursite.com/2017/02/24/learn-js-from-work/index.html">
<meta property="og:site_name" content="Andre Huang">
<meta property="og:description" content="This is a note for writing down what I have learnt through my work.  And this note is for JavaScript.">
<meta property="og:updated_time" content="2017-11-05T02:24:32.458Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="踩坑 - JavaScript 篇">
<meta name="twitter:description" content="This is a note for writing down what I have learnt through my work.  And this note is for JavaScript.">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    version: '5.1.3',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/2017/02/24/learn-js-from-work/"/>





  <title>踩坑 - JavaScript 篇 | Andre Huang</title>
  





  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?34d0124ba07f7b664e5564e7636c019b";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/"  class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">Andre Huang</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle"></p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://yoursite.com/2017/02/24/learn-js-from-work/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="Andre Huang">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="Andre Huang">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">踩坑 - JavaScript 篇</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-02-24T23:15:45+08:00">
                2017-02-24
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>This is a note for writing down what I have learnt through my work. </p>
<p>And this note is for JavaScript.</p>
<a id="more"></a>
<hr>
<h1 id="&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x7684;&#x9A8C;&#x8BC1;"><a href="#&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x7684;&#x9A8C;&#x8BC1;" class="headerlink" title="&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x7684;&#x9A8C;&#x8BC1;"></a>&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x7684;&#x9A8C;&#x8BC1;</h1><p>&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x7684;&#x89C4;&#x5219;&#xFF08;2015&#x5E74;&#xFF09;&#x8BE6;&#x89C1;&#xFF1A;<a href="http://qyj.saic.gov.cn/wjfb/201509/t20150929_162430.html" target="_blank" rel="external">&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x7F16;&#x7801;&#x89C4;&#x5219;</a><br>&#x7ED3;&#x6784;</p>
<p>&#x7EDF;&#x4E00;&#x4EE3;&#x7801;&#x7531;&#x5341;&#x516B;&#x4F4D;&#x7684;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x6216;&#x5927;&#x5199;&#x82F1;&#x6587;&#x5B57;&#x6BCD;&#xFF08;&#x4E0D;&#x4F7F;&#x7528;I&#x3001;O&#x3001;Z&#x3001;S&#x3001;V&#xFF09;&#x7EC4;&#x6210;&#x3002;</p>
<p>&#x7B2C;1&#x4F4D;&#xFF1A;&#x767B;&#x8BB0;&#x7BA1;&#x7406;&#x90E8;&#x95E8;&#x4EE3;&#x7801;&#xFF08;&#x5171;&#x4E00;&#x4F4D;&#x5B57;&#x7B26;&#xFF09;&#x7B2C;2&#x4F4D;&#xFF1A;&#x673A;&#x6784;&#x7C7B;&#x522B;&#x4EE3;&#x7801;&#xFF08;&#x5171;&#x4E00;&#x4F4D;&#x5B57;&#x7B26;&#xFF09;&#x7B2C;3&#x4F4D;~&#x7B2C;8&#x4F4D;&#xFF1A;&#x767B;&#x8BB0;&#x7BA1;&#x7406;&#x673A;&#x5173;&#x884C;&#x653F;&#x533A;&#x5212;&#x7801;&#xFF08;&#x5171;&#x516D;&#x4F4D;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#xFF09;&#x7B2C;9&#x4F4D;~&#x7B2C;17&#x4F4D;&#xFF1A;&#x4E3B;&#x4F53;&#x6807;&#x8BC6;&#x7801;&#xFF08;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x4EE3;&#x7801;&#xFF09;&#xFF08;&#x5171;&#x4E5D;&#x4F4D;&#x5B57;&#x7B26;&#xFF09;&#x7B2C;18&#x4F4D;&#xFF1A;&#x6821;&#x9A8C;&#x7801;&#xFF08;&#x5171;&#x4E00;&#x4F4D;&#x5B57;&#x7B26;&#xFF09;</p>
<p>&#x4EE3;&#x7801;&#x53CA;&#x8BF4;&#x660E;</p>
<p>&#x767B;&#x8BB0;&#x7BA1;&#x7406;&#x90E8;&#x95E8;&#x4EE3;&#x7801;&#xFF1A;&#x4F7F;&#x7528;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x6216;&#x5927;&#x5199;&#x82F1;&#x6587;&#x5B57;&#x6BCD;&#x8868;&#x793A;&#x3002;</p>
<p>&#x673A;&#x6784;&#x7F16;&#x5236;&#xFF1A;1&#x6C11;&#x653F;&#xFF1A;5&#x5DE5;&#x5546;&#xFF1A;9&#x5176;&#x4ED6;&#xFF1A;Y</p>
<p>&#x673A;&#x6784;&#x7C7B;&#x522B;&#x4EE3;&#x7801;&#xFF1A;&#x4F7F;&#x7528;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x6216;&#x5927;&#x5199;&#x82F1;&#x6587;&#x5B57;&#x6BCD;&#x8868;&#x793A;&#x3002;</p>
<p>&#x673A;&#x6784;&#x7F16;&#x5236;&#x673A;&#x5173;&#xFF1A;11&#x6253;&#x5934;&#x673A;&#x6784;&#x7F16;&#x5236;&#x4E8B;&#x4E1A;&#x5355;&#x4F4D;&#xFF1A;12&#x6253;&#x5934;&#x673A;&#x6784;&#x7F16;&#x5236;&#x4E2D;&#x592E;&#x7F16;&#x529E;&#x76F4;&#x63A5;&#x7BA1;&#x7406;&#x673A;&#x6784;&#x7F16;&#x5236;&#x7684;&#x7FA4;&#x4F17;&#x56E2;&#x4F53;&#xFF1A;13&#x6253;&#x5934;&#x673A;&#x6784;&#x7F16;&#x5236;&#x5176;&#x4ED6;&#xFF1A;19&#x6253;&#x5934;&#x6C11;&#x653F;&#x793E;&#x4F1A;&#x56E2;&#x4F53;&#xFF1A;51&#x6253;&#x5934;&#x6C11;&#x653F;&#x6C11;&#x529E;&#x975E;&#x4F01;&#x4E1A;&#x5355;&#x4F4D;&#xFF1A;52&#x6253;&#x5934;&#x6C11;&#x653F;&#x57FA;&#x91D1;&#x4F1A;&#xFF1A;53&#x6253;&#x5934;&#x6C11;&#x653F;&#x5176;&#x4ED6;&#xFF1A;59&#x6253;&#x5934;&#x5DE5;&#x5546;&#x4F01;&#x4E1A;&#xFF1A;91&#x6253;&#x5934;&#x5DE5;&#x5546;&#x4E2A;&#x4F53;&#x5DE5;&#x5546;&#x6237;&#xFF1A;92&#x6253;&#x5934;&#x5DE5;&#x5546;&#x519C;&#x6C11;&#x4E13;&#x4E1A;&#x5408;&#x4F5C;&#x793E;&#xFF1A;93&#x6253;&#x5934;&#x5176;&#x4ED6;&#xFF1A;Y1&#x6253;&#x5934;</p>
<p>&#x767B;&#x8BB0;&#x7BA1;&#x7406;&#x673A;&#x5173;&#x884C;&#x653F;&#x533A;&#x5212;&#x7801;&#xFF1A;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x8868;&#x793A;&#x3002;&#x6309;&#x7167;GB/T 2260&#x7F16;&#x7801;&#x3002;</p>
<p>&#x4E3B;&#x4F53;&#x6807;&#x8BC6;&#x7801;&#xFF08;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x4EE3;&#x7801;&#xFF09;&#xFF1A;&#x4F7F;&#x7528;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x6216;&#x82F1;&#x6587;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#x8868;&#x793A;&#x3002;&#x6309;&#x7167;GB 11714&#x7F16;&#x7801;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x884C;&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x4E4B;&#x524D;&#xFF0C;&#x4EE5;&#x524D;&#x7684;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x4EE3;&#x7801;&#x8BC1;&#x4E0A;&#x7684;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x4EE3;&#x7801;&#x7531;&#x4E5D;&#x4F4D;&#x5B57;&#x7B26;&#x7EC4;&#x6210;&#x3002;&#x683C;&#x5F0F;&#x4E3A;XXXXXXXX-Y&#x3002;&#x524D;&#x9762;&#x516B;&#x4F4D;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x672C;&#x4F53;&#x4EE3;&#x7801;&#x201D;&#xFF1B;&#x6700;&#x540E;&#x4E00;&#x4F4D;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x6821;&#x9A8C;&#x7801;&#x201D;&#x3002;&#x6821;&#x9A8C;&#x7801;&#x548C;&#x672C;&#x4F53;&#x4EE3;&#x7801;&#x7531;&#x4E00;&#x4E2A;&#x8FDE;&#x5B57;&#x53F7;&#xFF08;-&#xFF09;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;&#x4EE5;&#x4FBF;&#x8BA9;&#x4EBA;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x770B;&#x51FA;&#x6821;&#x9A8C;&#x7801;&#x3002;&#x4F46;&#x662F;&#x4E09;&#x8BC1;&#x5408;&#x4E00;&#x540E;&#xFF0C;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x7684;&#x4E5D;&#x4F4D;&#x5B57;&#x7B26;&#x5168;&#x90E8;&#x88AB;&#x7EB3;&#x5165;&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x7684;&#x7B2C;9&#x4F4D;&#x81F3;&#x7B2C;17&#x4F4D;&#xFF0C;&#x5176;&#x539F;&#x6709;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x4EE3;&#x7801;&#x4E0A;&#x7684;&#x8FDE;&#x5B57;&#x53F7;&#x4E0D;&#x5E26;&#x5165;&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x539F;&#x6709;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x4EE3;&#x7801;&#x4E0A;&#x7684;&#x201C;&#x6821;&#x9A8C;&#x7801;&#x201D;&#x7684;&#x8BA1;&#x7B97;&#x89C4;&#x5219;&#x662F;&#xFF1A;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;&#x67D0;&#x516C;&#x53F8;&#x7684;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x4EE3;&#x7801;&#x662F;&#xFF1A;59467239-9&#x3002;&#x90A3;&#x5176;&#x6700;&#x540E;&#x4E00;&#x4F4D;&#x7684;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x4EE3;&#x7801;&#x6821;&#x9A8C;&#x7801;9&#x662F;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x5462;&#xFF1F;</p>
<p>&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x53D6;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x4EE3;&#x7801;&#x7684;&#x524D;&#x516B;&#x4F4D;&#x672C;&#x4F53;&#x4EE3;&#x7801;&#x4E3A;&#x57FA;&#x6570;&#x3002;5 9 4 6 7 2 3 9 <em>&#x63D0;&#x793A;&#xFF1A;&#x5982;&#x679C;&#x672C;&#x4F53;&#x4EE3;&#x7801;&#x4E2D;&#x542B;&#x6709;&#x82F1;&#x6587;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#x3002;&#x5219;A&#x7684;&#x57FA;&#x6570;&#x662F;10&#xFF0C;B&#x7684;&#x57FA;&#x6570;&#x662F;11&#xFF0C;C&#x7684;&#x57FA;&#x6570;&#x662F;12&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x76F4;&#x5230;Z&#x7684;&#x57FA;&#x6570;&#x662F;35&#x3002;</em></p>
<p>&#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;&#x53D6;&#x52A0;&#x6743;&#x56E0;&#x5B50;&#x6570;&#x503C;&#x3002;&#x56E0;&#x4E3A;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x4EE3;&#x7801;&#x7684;&#x672C;&#x4F53;&#x4EE3;&#x7801;&#x4E00;&#x5171;&#x662F;&#x516B;&#x4F4D;&#x5B57;&#x7B26;&#x3002;&#x5219;&#x8FD9;&#x516B;&#x4F4D;&#x7684;&#x52A0;&#x6743;&#x56E0;&#x5B50;&#x6570;&#x503C;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x5206;&#x522B;&#x662F;&#xFF1A;3&#x3001;7&#x3001;9&#x3001;10&#x3001;5&#x3001;8&#x3001;4&#x3001;2&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x6B65;&#xFF1A;&#x672C;&#x4F53;&#x4EE3;&#x7801;&#x57FA;&#x6570;&#x4E0E;&#x5BF9;&#x5E94;&#x4F4D;&#x6570;&#x7684;&#x56E0;&#x5B50;&#x6570;&#x503C;&#x76F8;&#x4E58;&#x3002;<br>5&#xD7;3&#xFF1D;15&#xFF0C;9&#xD7;7&#xFF1D;63&#xFF0C;4&#xD7;9&#xFF1D;36&#xFF0C;6&#xD7;10&#xFF1D;60&#xFF0C;7&#xD7;5&#xFF1D;35&#xFF0C;2&#xD7;8&#xFF1D;16&#xFF0C;3&#xD7;4=12&#xFF0C;9&#xD7;2&#xFF1D;18</p>
<p>&#x7B2C;&#x56DB;&#x6B65;&#xFF1A;&#x5C06;&#x4E58;&#x79EF;&#x6C42;&#x548C;&#x76F8;&#x52A0;&#x3002;15+63+36+60+35+16+12+18=255</p>
<p>&#x7B2C;&#x4E94;&#x6B65;&#xFF1A;&#x5C06;&#x548C;&#x6570;&#x9664;&#x4EE5;11&#xFF0C;&#x6C42;&#x4F59;&#x6570;&#x3002;255&#xF7;11=33&#xFF0C;&#x4F59;&#x6570;&#x662F;2&#x3002;</p>
<p>&#x7B2C;&#x516D;&#x6B65;&#xFF1A;&#x7528;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;11&#x51CF;&#x53BB;&#x4F59;&#x6570;&#xFF0C;&#x5F97;&#x6C42;&#x6821;&#x9A8C;&#x7801;&#x7684;&#x6570;&#x503C;&#x3002;&#x5F53;&#x6821;&#x9A8C;&#x7801;&#x7684;&#x6570;&#x503C;&#x4E3A;10&#x65F6;&#xFF0C;&#x6821;&#x9A8C;&#x7801;&#x7528;&#x82F1;&#x6587;&#x5927;&#x5199;&#x5B57;&#x6BCD;X&#x6765;&#x8868;&#x793A;&#xFF1B;&#x5F53;&#x6821;&#x9A8C;&#x7801;&#x7684;&#x6570;&#x503C;&#x4E3A;11&#x65F6;&#xFF0C;&#x6821;&#x9A8C;&#x7801;&#x7528;0&#x6765;&#x8868;&#x793A;&#xFF1B;&#x5176;&#x4F59;&#x6C42;&#x51FA;&#x7684;&#x6821;&#x9A8C;&#x7801;&#x6570;&#x503C;&#x5C31;&#x7528;&#x5176;&#x672C;&#x8EAB;&#x7684;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x6765;&#x8868;&#x793A;&#x3002;11-2&#xFF1D;9&#xFF0C;&#x56E0;&#x6B64;&#x6B64;&#x516C;&#x53F8;&#x5B8C;&#x6574;&#x7684;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x4EE3;&#x7801;&#x4E3A; 59467239-9&#x3002;</p>
<p><strong>&#x6821;&#x9A8C;&#x7801;</strong>&#xFF1A;&#x4F7F;&#x7528;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x6216;&#x5927;&#x5199;&#x82F1;&#x6587;&#x5B57;&#x6BCD;&#x6765;&#x8868;&#x793A;&#x3002;&#x6821;&#x9A8C;&#x7801;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x53C2;&#x7167; GB/T 17710&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;&#x67D0;&#x516C;&#x53F8;&#x7684;&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x4E3A;91512081MA62K0260E&#xFF0C;&#x90A3;&#x5176;&#x6700;&#x540E;&#x4E00;&#x4F4D;&#x7684;&#x6821;&#x9A8C;&#x7801;E&#x662F;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x5462;&#xFF1F;</p>
<p>&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x53D6;&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x7684;&#x524D;&#x5341;&#x4E03;&#x4F4D;&#x4E3A;&#x57FA;&#x6570;&#x3002;9 1 5 1 2 0 8 1 21 10 6 2 19 0 2 6 0  <em>&#x63D0;&#x793A;&#xFF1A;&#x5982;&#x679C;&#x524D;&#x5341;&#x4E03;&#x4F4D;&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x542B;&#x6709;&#x82F1;&#x6587;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#xFF08;&#x4E0D;&#x4F7F;&#x7528;I&#x3001;O&#x3001;Z&#x3001;S&#x3001;V&#x8FD9;&#x4E94;&#x4E2A;&#x82F1;&#x6587;&#x5B57;&#x6BCD;&#xFF09;&#x3002;&#x5219;&#x82F1;&#x6587;&#x5B57;&#x6BCD;&#x5BF9;&#x5E94;&#x7684;&#x57FA;&#x6570;&#x5206;&#x522B;&#x4E3A;&#xFF1A;A=10&#x3001;B=11&#x3001;C=12&#x3001;D=13&#x3001;E=14&#x3001;F=15&#x3001;G=16&#x3001;H=17&#x3001;J=18&#x3001;K=19&#x3001;L=20&#x3001;M=21&#x3001;N=22&#x3001;P=23&#x3001;Q=24&#x3001;R=25&#x3001;T=26&#x3001;U=27&#x3001;W=28&#x3001;X=29&#x3001;Y=30</em></p>
<p>&#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;&#x53D6;&#x52A0;&#x6743;&#x56E0;&#x5B50;&#x6570;&#x503C;&#x3002;&#x56E0;&#x4E3A;&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x524D;&#x9762;&#x524D;&#x9762;&#x6709;&#x5341;&#x4E03;&#x4F4D;&#x5B57;&#x7B26;&#x3002;&#x5219;&#x8FD9;&#x5341;&#x4E03;&#x4F4D;&#x7684;&#x52A0;&#x6743;&#x56E0;&#x5B50;&#x6570;&#x503C;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x5206;&#x522B;&#x662F;&#xFF1A;1&#x3001;3&#x3001;9&#x3001;27&#x3001;19&#x3001;26&#x3001;16&#x3001;17&#x3001;20&#x3001;29&#x3001;25&#x3001;13&#x3001;8&#x3001;24&#x3001;10&#x3001;30&#x3001;28</p>
<p>&#x7B2C;&#x4E09;&#x6B65;&#xFF1A;&#x57FA;&#x6570;&#x4E0E;&#x5BF9;&#x5E94;&#x4F4D;&#x6570;&#x7684;&#x56E0;&#x5B50;&#x6570;&#x503C;&#x76F8;&#x4E58;&#x3002;9&#xD7;1=9&#xFF0C;1&#xD7;3=3&#xFF0C;5&#xD7;9=45&#xFF0C;1&#xD7;27=27&#xFF0C;2&#xD7;19=38&#xFF0C;0&#xD7;26=0&#xFF0C;8&#xD7;16=1281&#xD7;17=17&#xFF0C;21&#xD7;20=420&#xFF0C;10&#xD7;29=290&#xFF0C;6&#xD7;25=150&#xFF0C;2&#xD7;13=26&#xFF0C;19&#xD7;8=1520&#xD7;23=0&#xFF0C;2&#xD7;10=20&#xFF0C;6&#xD7;30=180&#xFF0C;0&#xD7;28=0</p>
<p>&#x7B2C;&#x56DB;&#x6B65;&#xFF1A;&#x5C06;&#x4E58;&#x79EF;&#x6C42;&#x548C;&#x76F8;&#x52A0;&#x3002;9+3+45+27+38+0+128+17+420+290+150+26+152+0+20+180+0=1495</p>
<p>&#x7B2C;&#x4E94;&#x6B65;&#xFF1A;&#x5C06;&#x548C;&#x6570;&#x9664;&#x4EE5;31&#xFF0C;&#x6C42;&#x4F59;&#x6570;&#x3002;1495&#xF7;31=48&#xFF0C;&#x4F59;&#x6570;&#x662F;17&#x3002;</p>
<p>&#x7B2C;&#x516D;&#x6B65;&#xFF1A;&#x7528;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;31&#x51CF;&#x53BB;&#x4F59;&#x6570;&#xFF0C;&#x5F97;&#x6C42;&#x6821;&#x9A8C;&#x7801;&#x7684;&#x6570;&#x503C;&#x3002;&#x5F53;&#x6821;&#x9A8C;&#x7801;&#x7684;&#x6570;&#x503C;&#x4E3A;0~9&#x65F6;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x7528;&#x8BE5;&#x6821;&#x9A8C;&#x7801;&#x7684;&#x6570;&#x503C;&#x4F5C;&#x4E3A;&#x6700;&#x7EC8;&#x7684;&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x7684;&#x6821;&#x9A8C;&#x7801;&#xFF1B;&#x5982;&#x679C;&#x6821;&#x9A8C;&#x7801;&#x7684;&#x6570;&#x503C;&#x662F;10~30&#xFF0C;&#x5219;&#x6821;&#x9A8C;&#x7801;&#x8F6C;&#x6362;&#x4E3A;&#x5BF9;&#x5E94;&#x7684;&#x5927;&#x5199;&#x82F1;&#x6587;&#x5B57;&#x6BCD;&#x3002;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x4E3A;&#xFF1A;A=10&#x3001;B=11&#x3001;C=12&#x3001;D=13&#x3001;E=14&#x3001;F=15&#x3001;G=16&#x3001;H=17&#x3001;J=18&#x3001;K=19&#x3001;L=20&#x3001;M=21&#x3001;N=22&#x3001;P=23&#x3001;Q=24&#x3001;R=25&#x3001;T=26&#x3001;U=27&#x3001;W=28&#x3001;X=29&#x3001;Y=30</p>
<p>&#x56E0;&#x4E3A;&#xFF0C;31-17&#xFF1D;14&#xFF0C;&#x6240;&#x4EE5;&#x8BE5;&#x516C;&#x53F8;&#x5B8C;&#x6574;&#x7684;&#x7EDF;&#x4E00;&#x793E;&#x4F1A;&#x4FE1;&#x7528;&#x4EE3;&#x7801;&#x4E3A; 91512081MA62K0260E&#x3002;<br><figure class="highlight plain"><table><tr><td class="code"><pre><div class="line">creditcode: function(element) {</div><div class="line">    var str = element.value + &apos;&apos;;</div><div class="line">    var roughReg = /[IOZVS]/;</div><div class="line">    var specificReg = /^((1[1239])|(5[1239])|(9[123])|(Y1))\d{6}[0-9ABCDEFGHJKLMNPQRTUWXY]{9}$/;    // &#x524D;17&#x4F4D;</div><div class="line">    var baseMap = {};    // &#x5B58;&#x653E;&#x57FA;&#x6570;&#x7684;Map</div><div class="line">    var allow = &apos;ABCDEFGHJKLMNPQRTUWXY&apos;.split(&apos;&apos;);    // &#x5141;&#x8BB8;&#x7684;&#x82F1;&#x6587;&#x5B57;&#x6BCD;&#xFF08;&#x7528;&#x6765;&#x751F;&#x6210;&#x5B57;&#x6BCD;&#x7684;&#x57FA;&#x6570;&#x5BF9;&#x7167;&#x8868;&#xFF09;</div><div class="line">    var weighting = [1,3,9,27,19,26,16,17,20,29,25,13,8,24,10,30,28];    // &#x52A0;&#x6743;&#x56E0;&#x5B50;</div><div class="line">    var letterReg = /^[A-Z]$/;</div><div class="line"></div><div class="line">    var first17 = str.slice(0, str.length-1);</div><div class="line">    var arr = str.split(&apos;&apos;);</div><div class="line"></div><div class="line">    if (str.length !== 18) return &apos;!18&apos;;</div><div class="line">    if (roughReg.test(str) === true) return &apos;rough&apos;;</div><div class="line">    if (specificReg.test(first17) !== true) return &apos;specific&apos;;</div><div class="line"></div><div class="line">    // &#x751F;&#x6210;&#x5B57;&#x6BCD;&#x7684;&#x57FA;&#x6570;&#x5BF9;&#x7167;&#x8868;</div><div class="line">    for(var i=0, len=allow.length, base=10; i&lt;len; i++, base++) {</div><div class="line">        baseMap[ allow[i] ] = base;</div><div class="line">    }</div><div class="line"></div><div class="line">    // &#x57FA;&#x6570;&#x548C;&#x5BF9;&#x5E94;&#x4F4D;&#x6570;&#x7684;&#x52A0;&#x6743;&#x56E0;&#x5B50;&#x6570;&#x503C;&#x76F8;&#x4E58;&#xFF0C;&#x5E76;&#x628A;&#x4E58;&#x79EF;&#x6C42;&#x548C;</div><div class="line">    var sum = 0;</div><div class="line">    for(var j=0, leng=first17.length; j&lt;leng; j++) {</div><div class="line">        if ( letterReg.test(first17[j]) === true ) {</div><div class="line">            sum += parseInt( baseMap[ first17[j] ] ) * weighting[j];</div><div class="line">        } else {</div><div class="line">            sum += parseInt( first17[j] ) * weighting[j];</div><div class="line">        }</div><div class="line">    }</div><div class="line"></div><div class="line">    // &#x5BF9;&#x603B;&#x548C;&#x8FDB;&#x884C;31&#x6C42;&#x4F59;&#xFF0C;&#x5F97;&#x5230;&#x4F59;&#x6570;</div><div class="line">    var rest = sum % 31;</div><div class="line">    // &#x7528;31&#x51CF;&#x53BB;&#x4F59;&#x6570;&#xFF0C;0-9&#x76F4;&#x63A5;&#x4F5C;&#x4E3A;&#x6821;&#x9A8C;&#x7801;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x5728;&#x57FA;&#x6570;&#x5BF9;&#x7167;&#x8868;&#x67E5;&#x627E;</div><div class="line">    var minus = 31 - rest;</div><div class="line">    var validChar;</div><div class="line">    if (minus &gt;= 10) {</div><div class="line">        if (minus != 31) {</div><div class="line">            for(var k in baseMap) {</div><div class="line">                if (baseMap.hasOwnProperty(k) &amp;&amp; baseMap[k] === minus) {</div><div class="line">                    validChar = k;</div><div class="line">                    break;</div><div class="line">                }</div><div class="line">            }</div><div class="line">        } else {</div><div class="line">            // &#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF0C;&#x603B;&#x548C;&#x521A;&#x597D;&#x88AB;31&#x6574;&#x9664;&#xFF0C;&#x8FD9;&#x6837;&#x7B97;0</div><div class="line">            validChar = 0;</div><div class="line">        }</div><div class="line"></div><div class="line">    } else {</div><div class="line">        validChar = minus;</div><div class="line">    }</div><div class="line">    // &#x548C;&#x6700;&#x540E;&#x4E00;&#x4F4D;&#x505A;&#x6BD4;&#x8F83;</div><div class="line">    if (str[17] == validChar) {</div><div class="line">        return true;</div><div class="line">    } else {</div><div class="line">        return false;</div><div class="line">    }</div><div class="line">}</div></pre></td></tr></table></figure></p>
<p>&#xFF08;&#x4EE3;&#x7801;&#x53EA;&#x662F;&#x4E2A;&#x521D;&#x59CB;&#x7248;&#xFF0C;&#x672A;&#x7ECF;&#x8FC7;&#x4F18;&#x5316;&#xFF09;</p>
<h1 id="&#x76D1;&#x542C;&#x8F93;&#x5165;&#x6CD5;&#x7684;&#x4E8B;&#x4EF6;-compositionstart-amp-compositionend&#x3002;"><a href="#&#x76D1;&#x542C;&#x8F93;&#x5165;&#x6CD5;&#x7684;&#x4E8B;&#x4EF6;-compositionstart-amp-compositionend&#x3002;" class="headerlink" title="&#x76D1;&#x542C;&#x8F93;&#x5165;&#x6CD5;&#x7684;&#x4E8B;&#x4EF6; compositionstart &amp; compositionend&#x3002;"></a>&#x76D1;&#x542C;&#x8F93;&#x5165;&#x6CD5;&#x7684;&#x4E8B;&#x4EF6; compositionstart &amp; compositionend&#x3002;</h1><p>&#x524D;&#x8005;&#x662F;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x8F93;&#x5165;&#x6CD5;&#x65F6;&#x89E6;&#x53D1;&#xFF08;&#x6B64;&#x65F6;&#x8FD8;&#x6CA1;&#x6709;&#x9009;&#x8BCD;&#xFF09;&#xFF0C;&#x540E;&#x8005;&#x662F;&#x5F53;&#x9009;&#x5B9A;&#x67D0;&#x4E2A;&#x8BCD;&#xFF0C;&#x7ED3;&#x675F;&#x8F93;&#x5165;&#x65F6;&#x89E6;&#x53D1;&#x3002;<br><figure class="highlight plain"><table><tr><td class="code"><pre><div class="line">$(&apos;#test-form&apos;).on(&apos;compositionend paste&apos;, &apos;#validcompany&apos;, function(event){</div><div class="line">    var $this = $(this);</div><div class="line">    var type = &apos;name&apos;;</div><div class="line">    if ( validType(&apos;chinese&apos;, $this.val()) ) { // &#x901A;&#x8FC7;&#x516C;&#x53F8;&#x540D;&#x79F0;&#x9A8C;&#x8BC1;</div><div class="line">        console.log(2);</div><div class="line">        try{</div><div class="line">            clearTimeout(times); </div><div class="line">        } catch(e) {</div><div class="line">            console.log(e);</div><div class="line">        }</div><div class="line">        times = setTimeout(function(){</div><div class="line">            getQuery($this, type, paintResult);</div><div class="line">        },300);</div><div class="line">    }</div><div class="line">})</div></pre></td></tr></table></figure></p>
<h1 id="&#x641C;&#x7D22;&#x6846;&#x6839;&#x636E;&#x7528;&#x6237;&#x8F93;&#x5165;&#x5185;&#x5BB9;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#x3002;"><a href="#&#x641C;&#x7D22;&#x6846;&#x6839;&#x636E;&#x7528;&#x6237;&#x8F93;&#x5165;&#x5185;&#x5BB9;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#x3002;" class="headerlink" title="&#x641C;&#x7D22;&#x6846;&#x6839;&#x636E;&#x7528;&#x6237;&#x8F93;&#x5165;&#x5185;&#x5BB9;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#x3002;"></a>&#x641C;&#x7D22;&#x6846;&#x6839;&#x636E;&#x7528;&#x6237;&#x8F93;&#x5165;&#x5185;&#x5BB9;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#x3002;</h1><p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x952E;&#x76D8;&#x4E8B;&#x4EF6; keydown &#x76D1;&#x542C;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5143;&#x7D20;&#x7684; propertychange &#x4E8B;&#x4EF6;&#xFF08;IE &#x662F; input &#x4E8B;&#x4EF6;&#xFF09;&#xFF0C;&#x76D1;&#x542C;&#x5143;&#x7D20;&#x5C5E;&#x6027;&#x503C;&#x7684;&#x53D8;&#x5316;&#x3002;<br>&#x76D1;&#x542C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E0D;&#x4F1A;&#x5373;&#x65F6;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF0C;&#x4E00;&#x822C;&#x901A;&#x8FC7;&#x76D1;&#x89C6;&#x7528;&#x6237;&#x8F93;&#x5165;&#xFF0C;&#x5F53;&#x8FBE;&#x5230; 300ms &#x7684;&#x505C;&#x987F;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x3002;<br>&#x5B9E;&#x73B0;&#xFF1A;<br><figure class="highlight plain"><table><tr><td class="code"><pre><div class="line">// &#x5728; keydown &#x6216;&#x8005;&#x662F; propertychange &#x7B49;&#x4E8B;&#x4EF6;&#x7684; handler &#x4E2D;&#x4F7F;&#x7528; JavaScript &#x7684;&#x5B9A;&#x65F6;&#x5668;</div><div class="line">try {</div><div class="line">    clearTimeout(timer);</div><div class="line">} catch(e) {</div><div class="line">    console.log(e)</div><div class="line">}</div><div class="line">times = setTimeout(doSomething, 300);</div></pre></td></tr></table></figure></p>
<h1 id="Ajax-&#x53C2;&#x6570;"><a href="#Ajax-&#x53C2;&#x6570;" class="headerlink" title="Ajax &#x53C2;&#x6570;"></a>Ajax &#x53C2;&#x6570;</h1><p>&#x5728;&#x4F7F;&#x7528; jQuery &#x7684; ajax() &#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x53C2;&#x6570;&#x4E0D;&#x80FD;&#x4F20;&#x4E00;&#x4E2A; DOM &#x5BF9;&#x8C61;&#xFF08;&#x55EF;&#xFF0C;&#x6211;&#x662F;&#x624B;&#x8BEF;= =b&#xFF09;&#x3002;<br>&#x4E00;&#x65E6;&#x624B;&#x8BEF;&#x4F20;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x6267;&#x884C; ajax() &#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x62A5;&#x9519;&#xFF1A;    </p>
<pre><code>Uncaught RangeError: Maximum call stack size exceeded
</code></pre>
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/JavaScript/" rel="tag"># JavaScript</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/02/24/learn-css-from-work/" rel="next" title="踩坑 - CSS 篇">
                <i class="fa fa-chevron-left"></i> 踩坑 - CSS 篇
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/03/14/learn-paths-of-nodejs/" rel="prev" title="NodeJS 几个常见的路径">
                NodeJS 几个常见的路径 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpg"
                alt="Andre Huang" />
            
              <p class="site-author-name" itemprop="name">Andre Huang</p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="/archives/">
              
                  <span class="site-state-item-count">41</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">19</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          

          <div class="links-of-author motion-element">
            
              
                <span class="links-of-author-item">
                  <a href="https://github.com/huangza" target="_blank" title="GitHub">
                    
                      <i class="fa fa-fw fa-github"></i>GitHub</a>
                </span>
              
            
          </div>

          
          

          
          

          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#统一社会信用代码的验证"><span class="nav-number">1.</span> <span class="nav-text">统一社会信用代码的验证</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#监听输入法的事件-compositionstart-amp-compositionend。"><span class="nav-number">2.</span> <span class="nav-text">监听输入法的事件 compositionstart & compositionend。</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#搜索框根据用户输入内容请求数据。"><span class="nav-number">3.</span> <span class="nav-text">搜索框根据用户输入内容请求数据。</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#Ajax-参数"><span class="nav-number">4.</span> <span class="nav-text">Ajax 参数</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Andre Huang</span>

  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Muse</a> v5.1.3</div>




        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  


  











  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="https://cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.pack.js"></script>

  
  <script type="text/javascript" src="/lib/canvas-nest/canvas-nest.min.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.3"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.3"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.3"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.3"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.3"></script>



  


  




	





  





  








  





  

  

  

  

  

  

</body>
</html>
